## dev
#### Terraform Initialization :gear: `success`
#### Terraform Plan :book: `success`

<details><summary>Show Plan</summary>

```terraform
module.GKE.module.vpc.google_compute_network.my_vpc: Refreshing state... [id=projects/logical-acolyte-423107-b5/global/networks/demo-vpc-1]
module.GKE.module.vpc.google_compute_router.router: Refreshing state... [id=projects/logical-acolyte-423107-b5/regions/us-east1/routers/router]
module.GKE.module.vpc.google_compute_address.nat: Refreshing state... [id=projects/logical-acolyte-423107-b5/regions/us-east1/addresses/cluster-nat]
module.GKE.module.subnet.google_compute_subnetwork.private_subnet: Refreshing state... [id=projects/logical-acolyte-423107-b5/regions/us-east1/subnetworks/demo-private-subnet]
module.GKE.google_container_cluster.primary: Refreshing state... [id=projects/logical-acolyte-423107-b5/locations/us-east1/clusters/demo-dev]
module.GKE.module.node_pool.google_container_node_pool.primary_nodes: Refreshing state... [id=projects/logical-acolyte-423107-b5/locations/us-east1/clusters/demo-dev/nodePools/node-pool]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.GKE.google_container_cluster.primary has been deleted
  - resource "google_container_cluster" "primary" {
      - endpoint                                 = "34.73.254.112" -> null
        id                                       = "projects/logical-acolyte-423107-b5/locations/us-east1/clusters/demo-dev"
      - name                                     = "demo-dev" -> null
        # (30 unchanged attributes hidden)

      - master_auth {
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }

        # (15 unchanged blocks hidden)
    }

  # module.GKE.module.node_pool.google_container_node_pool.primary_nodes has been deleted
  - resource "google_container_node_pool" "primary_nodes" {
        id                          = "projects/logical-acolyte-423107-b5/locations/us-east1/clusters/demo-dev/nodePools/node-pool"
      - name                        = "node-pool" -> null
        # (11 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy
 <= read (data resources)

Terraform will perform the following actions:

  # module.GKE.google_container_cluster.primary will be created
  + resource "google_container_cluster" "primary" {
      + cluster_ipv4_cidr                        = (known after apply)
      + datapath_provider                        = (known after apply)
      + default_max_pods_per_node                = (known after apply)
      + deletion_protection                      = false
      + enable_cilium_clusterwide_network_policy = false
      + enable_intranode_visibility              = (known after apply)
      + enable_kubernetes_alpha                  = false
      + enable_l4_ilb_subsetting                 = false
      + enable_legacy_abac                       = false
      + enable_shielded_nodes                    = true
      + endpoint                                 = (known after apply)
      + id                                       = (known after apply)
      + initial_node_count                       = 1
      + label_fingerprint                        = (known after apply)
      + location                                 = "us-east1"
      + logging_service                          = (known after apply)
      + master_version                           = (known after apply)
      + monitoring_service                       = (known after apply)
      + name                                     = "demo-dev-1"
      + network                                  = "demo-vpc-1"
      + networking_mode                          = (known after apply)
      + node_locations                           = (known after apply)
      + node_version                             = (known after apply)
      + operation                                = (known after apply)
      + private_ipv6_google_access               = (known after apply)
      + project                                  = (known after apply)
      + remove_default_node_pool                 = true
      + self_link                                = (known after apply)
      + services_ipv4_cidr                       = (known after apply)
      + subnetwork                               = "demo-private-subnet"
      + tpu_ipv4_cidr_block                      = (known after apply)

      + addons_config (known after apply)

      + authenticator_groups_config (known after apply)

      + cluster_autoscaling (known after apply)

      + confidential_nodes (known after apply)

      + cost_management_config (known after apply)

      + database_encryption (known after apply)

      + default_snat_status (known after apply)

      + gateway_api_config (known after apply)

      + identity_service_config (known after apply)

      + ip_allocation_policy (known after apply)

      + logging_config (known after apply)

      + master_auth (known after apply)

      + master_authorized_networks_config (known after apply)

      + mesh_certificates (known after apply)

      + monitoring_config (known after apply)

      + node_config (known after apply)

      + node_pool (known after apply)

      + node_pool_auto_config (known after apply)

      + node_pool_defaults (known after apply)

      + notification_config (known after apply)

      + release_channel (known after apply)

      + security_posture_config (known after apply)

      + service_external_ips_config (known after apply)

      + vertical_pod_autoscaling (known after apply)

      + workload_identity_config (known after apply)
    }

  # module.GKE.module.node_pool.data.google_container_engine_versions.gke_version will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "google_container_engine_versions" "gke_version" {
      + default_cluster_version         = (known after apply)
      + id                              = (known after apply)
      + latest_master_version           = (known after apply)
      + latest_node_version             = (known after apply)
      + location                        = "us-east1"
      + release_channel_default_version = (known after apply)
      + release_channel_latest_version  = (known after apply)
      + valid_master_versions           = (known after apply)
      + valid_node_versions             = (known after apply)
      + version_prefix                  = "1.27."
    }

  # module.GKE.module.node_pool.google_container_node_pool.primary_nodes will be created
  + resource "google_container_node_pool" "primary_nodes" {
      + cluster                     = "demo-dev-1"
      + id                          = (known after apply)
      + initial_node_count          = (known after apply)
      + instance_group_urls         = (known after apply)
      + location                    = "us-east1"
      + managed_instance_group_urls = (known after apply)
      + max_pods_per_node           = (known after apply)
      + name                        = "node-pool"
      + name_prefix                 = (known after apply)
      + node_count                  = 1
      + node_locations              = (known after apply)
      + operation                   = (known after apply)
      + project                     = "test-policy-423107"
      + version                     = (known after apply)

      + management (known after apply)

      + network_config (known after apply)

      + node_config {
          + disk_size_gb      = (known after apply)
          + disk_type         = (known after apply)
          + effective_taints  = (known after apply)
          + guest_accelerator = (known after apply)
          + image_type        = (known after apply)
          + labels            = {
              + "env" = "test-policy-423107"
            }
          + local_ssd_count   = (known after apply)
          + logging_variant   = (known after apply)
          + machine_type      = "n1-standard-1"
          + metadata          = {
              + "disable-legacy-endpoints" = "true"
            }
          + min_cpu_platform  = (known after apply)
          + oauth_scopes      = [
              + "https://www.googleapis.com/auth/logging.write",
              + "https://www.googleapis.com/auth/monitoring",
            ]
          + preemptible       = false
          + service_account   = (known after apply)
          + spot              = false
          + tags              = [
              + "gke-node",
              + "test-policy-423107-gke",
            ]

          + confidential_nodes (known after apply)

          + shielded_instance_config (known after apply)

          + workload_metadata_config (known after apply)
        }

      + upgrade_settings (known after apply)
    }

  # module.GKE.module.vpc.google_compute_router.router will be destroyed
  # (because google_compute_router.router is not in configuration)
  - resource "google_compute_router" "router" {
      - creation_timestamp            = "2024-05-20T01:49:03.411-07:00" -> null
      - encrypted_interconnect_router = false -> null
      - id                            = "projects/logical-acolyte-423107-b5/regions/us-east1/routers/router" -> null
      - name                          = "router" -> null
      - network                       = "https://www.googleapis.com/compute/v1/projects/logical-acolyte-423107-b5/global/networks/demo-vpc-1" -> null
      - project                       = "logical-acolyte-423107-b5" -> null
      - region                        = "us-east1" -> null
      - self_link                     = "https://www.googleapis.com/compute/v1/projects/logical-acolyte-423107-b5/regions/us-east1/routers/router" -> null
        # (1 unchanged attribute hidden)
    }

Plan: 2 to add, 0 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

Pusher: @yanirw, Action: `pull_request`

Comment to apply these changes to the current environment